"""
สร้างไฟล์ใหม่ FOLDER /assigments/week09/ lab-assignment-1109.py

เครื่องคำนวณค่าไฟฟ้าแบบขั้นบันได
เขียนโปรแกรมคำนวณค่าไฟฟ้าจากจำนวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น โดยใช้ฟังก์ชัน
calculate_eletricity_cost(units)

ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
จำนวนหน่วยที่ใช้      อัตราต่อหน่วย
1-50 หน่วยแรก      2.50 บาท
51-100 หน่วย       3.00 บาท
101-200 หน่วย      3.50 บาท
มากกว่า 200 หน่วย    4.00 บาท

ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน
เงื่อนไข 
. โปรแกรมแสดงเมนูวนซ้ำ
. ผู้ใช้เลือก 1 เพื่อคำนวณค่าไฟ
. ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
. หากเลือกเมนูอื่น ให้แจ้งว่าเลือกไม่ถูกต้อง
. จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ
. ให้แสดงรายละเอียดค่าไฟแต่ละช่วงและยอดรวมสุทธิ

ตัวอย่างหน้าจอ

===== โปรแกรมคำนวณค่าไฟฟ้า =====
1. คำนวณค่าไฟ
2. ออกจากโปรแกรม

เลือกเมนู: 1

กรอกจำนวนหน่วยไฟฟ้า: 120
รายละเอียดค่าไฟ:
1-50 หน่วย:   125.00 บาท
51-100 หน่วย: 150.00 บาท
101-200 หน่วย: 70.00 บาท
ค่าบริการ: 25.00 บาท

รวมค่าไฟทั้งสิ้น: 370.00 บาท
"""
def calculate_eletricity_cost(units):
    SERVICE_FEE = 25.0
    cost_1_50 = 0.0
    cost_51_100 = 0.0
    cost_101_200 = 0.0
    cost_over_200 = 0.0

    # คำนวณแยกตามช่วงขั้นบันได
    if units > 200:
        cost_over_200 = (units - 200) * 4.00 
        cost_101_200 = 100 * 3.50 
        cost_51_100 = 50 * 3.00 
        cost_1_50 = 50 * 2.50  

    elif units > 100:
        cost_101_200 = (units - 100) * 3.50 
        cost_51_100 = 50 * 3.00 
        cost_1_50 = 50 * 2.50   

    elif units > 50:
        cost_51_100 = (units - 50) * 3.00 
        cost_1_50 = 50 * 2.50

    elif units > 0:
        cost_1_50 = units * 2.50 


    # แสดงรายละเอียดค่าไฟแต่ละช่วง เฉพาะช่วงที่มีค่าบริการ
    print("รายละเอียดค่าไฟ:")
    if cost_1_50 > 0:
        print(f"1-50 หน่วย: {cost_1_50:.2f} บาท")
    if cost_51_100 > 0:
        print(f"51-100 หน่วย: {cost_51_100:.2f} บาท")
    if cost_101_200 > 0:
        print(f"101-200 หน่วย: {cost_101_200:.2f} บาท")
    if cost_over_200 > 0:
        print(f"มากกว่า 200 หน่วย: {cost_over_200:.2f} บาท")
    
    print(f"ค่าบริการ: {SERVICE_FEE:.2f} บาท")

    total_cost = cost_1_50 + cost_51_100 + cost_101_200 + cost_over_200 + SERVICE_FEE
    return total_cost

while True:
    print("\n===== โปรแกรมคำนวณค่าไฟฟ้า =====")
    print("1. คำนวณค่าไฟ")
    print("2. ออกจากโปรแกรม")
    
    choice = input("\nเลือกเมนู: ")

    if choice == '1':
        units = float(input("\nจำนวนหน่วยไฟฟ้า: "))
        
        # ตรวจสอบเงื่อนไขไม่ให้หน่วยติดลบ
        if units < 0:
            print("จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ!")
            continue
            
        # เรียกใช้ฟังก์ชัน def
        total_price = calculate_eletricity_cost(units)
        print(f"\nรวมค่าไฟทั้งสิ้น: {total_price:.2f} บาท")

    elif choice == '2':
        print("จบการทำงานของโปรแกรม")
        break
    else:
        print("เลือกเมนูไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง")
